EDT/ZUP/zup_edt/src/Documents/ФактПоказателяЭффективностиСотрудников/ФактПоказателяЭффективностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФактПоказателяЭффективностиСотрудников</name>
  <registerRecords>AccumulationRegister.ФактическиеЗначенияПоказателейЭффективностиСотрудников</registerRecords>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Горизонт</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.СтруктураЦелей</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Позиция</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяЭффективности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/AccumulationRegisters/ФактическиеЗначенияПоказателейЭффективностиСотрудников/ФактическиеЗначенияПоказателейЭффективностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФактическиеЗначенияПоказателейЭффективностиСотрудников</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.ЗначениеПоказателяЭффективности</types>
    </type>
  </resources>
  <dimensions>
    <name>Горизонт</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.СтруктураЦелей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/ZUP/zup_edt/src/Documents/ФактПоказателяЭффективностиСотрудников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ЗначениеДоступа = Подразделение;
	
	МассивФизическихЛиц = ФизическиеЛица.ВыгрузитьКолонку("ФизическоеЛицо");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Таблица, МассивФизическихЛиц, "ЗначениеДоступа");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.ФактПоказателяЭффективностиСотрудников.ПолучитьДанныеДляПроведения(Ссылка);
	КлючевыеПоказателиЭффективности.СформироватьДвиженияФактическиеЗначенияПоказателейЭффективностиСотрудников(Движения, ДанныеДляПроведения.ФактСотрудников);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтоСуммируемыйПоказатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Показатель, "Суммируемый");
	Если ЭтоСуммируемыйПоказатель = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФактаСотрудников = РегистрыНакопления.ФактическиеЗначенияПоказателейЭффективностиСотрудников.ТаблицаИзмеренийПланаСотрудников();
	
	Для каждого СтрокаСотрудника Из Сотрудники Цикл
		НоваяСтрока = ТаблицаФактаСотрудников.Добавить();
		НоваяСтрока.ДатаНачала = НачалоМесяца(Период);
		НоваяСтрока.ДатаОкончания = КонецМесяца(Период);
		НоваяСтрока.Горизонт = Горизонт;
		НоваяСтрока.Сотрудник = СтрокаСотрудника.Сотрудник;
		НоваяСтрока.Показатель = Показатель;
	КонецЦикла; 
	
	ТаблицаВведенныхЗначений = КлючевыеПоказателиЭффективности.ВведенныеФактическиеЗначенияПоказателейСотрудников(ТаблицаФактаСотрудников, Ссылка);
	
	Для каждого СтрокаВведенныхЗначений Из ТаблицаВведенныхЗначений Цикл
		НайденныеСтроки = Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", СтрокаВведенныхЗначений.Сотрудник));
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Для сотрудника %1 уже введено фактическое значение показателя %2.'"), СтрокаВведенныхЗначений.Сотрудник, Показатель);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Сотрудники[%1].Сотрудник", Сотрудники.Индекс(НайденнаяСтрока)),, Отказ);
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
